
<!-- saved from url=(0073)http://www.cs.tu.ac.th/uploads/upfiles/files/file/article/fingerprint.htm -->
<html><head><meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
<meta http-equiv="Content-Language" content="en-us">
<meta name="GENERATOR" content="Microsoft FrontPage 5.0">
<meta name="ProgId" content="FrontPage.Editor.Document">

<title>Fingerprint</title>
</head>

<body>

<p class="MsoNormal">
<font size="3"><b><span lang="th" style="FONT-FAMILY: Tahoma">
&#3614;&#3636;&#3626;&#3641;&#3592;&#3609;&#3660;&#3605;&#3633;&#3623;&#3605;&#3609;&#3604;&#3657;&#3623;&#3618;&#3621;&#3634;&#3618;&#3609;&#3636;&#3657;&#3623;&#3617;&#3639;&#3629; </span></b><span style="FONT-FAMILY: Tahoma"><b>:
<span lang="th">&#3611;&#3621;&#3629;&#3604;&#3616;&#3633;&#3618;&#3592;&#3619;&#3636;&#3591;&#3627;&#3619;&#3639;&#3629; </span>?</b><br>
</span>
<a style="color: blue; text-decoration: underline" href="mailto:dks@cs.tu.ac.th">
<span lang="EN-US" style="FONT-FAMILY: Tahoma">(</span><font face="Tahoma"><span lang="TH">&#3619;&#3624;. 
&#3604;&#3619;. &#3604;&#3623;&#3591;&#3649;&#3585;&#3657;&#3623; &#3626;&#3623;&#3634;&#3617;&#3636;&#3616;&#3633;&#3585;&#3604;&#3636;&#3660;</span></font></a></font><a style="color: blue; text-decoration: underline" href="mailto:dks@cs.tu.ac.th"><span lang="EN-US" style="FONT-FAMILY: Tahoma"><font size="3">)</font></span></a></p>
<p><span lang="th">&#3648;&#3617;&#3639;&#3656;&#3629;&#3627;&#3621;&#3634;&#3618;&#3648;&#3604;&#3639;&#3629;&#3609;&#3607;&#3637;&#3656;&#3612;&#3656;&#3634;&#3609;&#3617;&#3634; 
&#3612;&#3641;&#3657;&#3607;&#3637;&#3656;&#3605;&#3636;&#3604;&#3605;&#3634;&#3617;&#3586;&#3656;&#3634;&#3623;&#3626;&#3634;&#3619;&#3585;&#3634;&#3619;&#3648;&#3617;&#3639;&#3629;&#3591;&#3588;&#3591;&#3618;&#3633;&#3591;&#3592;&#3635;&#3586;&#3656;&#3634;&#3623;&#3585;&#3634;&#3619;&#3611;&#3619;&#3632;&#3594;&#3640;&#3617;&#3626;&#3616;&#3634;&#3631; 
&#3607;&#3637;&#3656;&#3617;&#3637;&#3585;&#3634;&#3619;&#3648;&#3626;&#3637;&#3618;&#3610;&#3610;&#3633;&#3605;&#3619;&#3621;&#3591;&#3588;&#3632;&#3649;&#3609;&#3609;&#3649;&#3607;&#3609;&#3585;&#3633;&#3609;&#3652;&#3604;&#3657; 
&#3649;&#3621;&#3632;&#3652;&#3604;&#3657;&#3617;&#3637;&#3585;&#3634;&#3619;&#3585;&#3621;&#3656;&#3634;&#3623;&#3606;&#3638;&#3591;&#3585;&#3634;&#3619;&#3609;&#3635;&#3648;&#3588;&#3619;&#3639;&#3656;&#3629;&#3591;&#3605;&#3619;&#3623;&#3592;&#3621;&#3634;&#3618;&#3609;&#3636;&#3657;&#3623;&#3617;&#3639;&#3629;&#3648;&#3586;&#3657;&#3634;&#3617;&#3634;&#3651;&#3594;&#3657;&#3649;&#3607;&#3609;&#3585;&#3634;&#3619;&#3648;&#3626;&#3637;&#3618;&#3610;&#3610;&#3633;&#3605;&#3619; 
&#3649;&#3605;&#3656;&#3605;&#3636;&#3604;&#3611;&#3633;&#3597;&#3627;&#3634;&#3607;&#3637;&#3656;&#3591;&#3610;&#3611;&#3619;&#3632;&#3617;&#3634;&#3603;&#3651;&#3609;&#3585;&#3634;&#3619;&#3605;&#3636;&#3604;&#3605;&#3633;&#3657;&#3591;&#3623;&#3656;&#3634;&#3626;&#3641;&#3591;&#3617;&#3634;&#3585; </span>(??!!) <span lang="th">
&#3585;&#3655;&#3648;&#3621;&#3618;&#3618;&#3633;&#3591;&#3652;&#3617;&#3656;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3611;&#3619;&#3633;&#3610;&#3611;&#3619;&#3640;&#3591;&#3648;&#3619;&#3639;&#3656;&#3629;&#3591;&#3609;&#3637;&#3657;&#3652;&#3604;&#3657; 
&#3651;&#3609;&#3610;&#3607;&#3588;&#3623;&#3634;&#3617;&#3609;&#3637;&#3657;&#3648;&#3619;&#3634;&#3592;&#3632;&#3586;&#3629;&#3652;&#3617;&#3656;&#3585;&#3621;&#3656;&#3634;&#3623;&#3606;&#3638;&#3591;&#3588;&#3623;&#3634;&#3617;&#3648;&#3611;&#3655;&#3609;&#3652;&#3611;&#3652;&#3604;&#3657;&#3651;&#3609;&#3585;&#3634;&#3619;&#3605;&#3636;&#3604;&#3605;&#3633;&#3657;&#3591;&#3619;&#3632;&#3610;&#3610;&#3604;&#3633;&#3591;&#3585;&#3621;&#3656;&#3634;&#3623;&#3604;&#3657;&#3623;&#3618;&#3588;&#3656;&#3634;&#3651;&#3594;&#3657;&#3592;&#3656;&#3634;&#3618;&#3607;&#3637;&#3656;&#3648;&#3627;&#3617;&#3634;&#3632;&#3626;&#3617; 
&#3648;&#3614;&#3619;&#3634;&#3632;&#3588;&#3609;&#3607;&#3637;&#3656;&#3629;&#3618;&#3641;&#3656;&#3651;&#3609;&#3623;&#3591;&#3585;&#3634;&#3619;&#3652;&#3629;&#3607;&#3637;&#3626;&#3656;&#3623;&#3609;&#3651;&#3627;&#3597;&#3656;&#3585;&#3655;&#3588;&#3591;&#3607;&#3619;&#3634;&#3610;&#3649;&#3621;&#3657;&#3623;&#3623;&#3656;&#3634; 
&#3648;&#3607;&#3588;&#3650;&#3609;&#3650;&#3621;&#3618;&#3637;&#3651;&#3609;&#3585;&#3634;&#3619;&#3614;&#3636;&#3626;&#3641;&#3592;&#3609;&#3660;&#3605;&#3633;&#3623;&#3605;&#3609;&#3604;&#3657;&#3623;&#3618;&#3621;&#3634;&#3618;&#3609;&#3636;&#3657;&#3623;&#3617;&#3639;&#3629;&#3609;&#3633;&#3657;&#3609;&#3617;&#3637;&#3617;&#3634;&#3609;&#3634;&#3609;&#3614;&#3629;&#3626;&#3617;&#3588;&#3623;&#3619;&#3649;&#3621;&#3657;&#3623; 
&#3592;&#3609;&#3651;&#3609;&#3611;&#3633;&#3592;&#3592;&#3640;&#3610;&#3633;&#3609;&#3652;&#3617;&#3656;&#3651;&#3594;&#3656;&#3648;&#3619;&#3639;&#3656;&#3629;&#3591;&#3586;&#3629;&#3591;&#3629;&#3640;&#3611;&#3585;&#3619;&#3603;&#3660;&#3607;&#3637;&#3656;&#3617;&#3637;&#3619;&#3634;&#3588;&#3634;&#3649;&#3614;&#3591;&#3649;&#3605;&#3656;&#3629;&#3618;&#3656;&#3634;&#3591;&#3651;&#3604; .... 
&#3649;&#3621;&#3632;&#3604;&#3657;&#3623;&#3618;&#3648;&#3607;&#3588;&#3650;&#3609;&#3650;&#3621;&#3618;&#3637;&#3607;&#3637;&#3656;&#3617;&#3637;&#3617;&#3634;&#3652;&#3604;&#3657;&#3626;&#3633;&#3585;&#3614;&#3633;&#3585;&#3651;&#3627;&#3597;&#3656;&#3654;&#3609;&#3637;&#3656;&#3649;&#3627;&#3621;&#3632; 
&#3592;&#3638;&#3591;&#3607;&#3635;&#3651;&#3627;&#3657;&#3652;&#3617;&#3656;&#3614;&#3657;&#3609;&#3588;&#3623;&#3634;&#3617;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3586;&#3629;&#3591;&#3610;&#3619;&#3619;&#3604;&#3634;&#3609;&#3633;&#3585;&#3648;&#3592;&#3634;&#3632;&#3607;&#3637;&#3656;&#3605;&#3633;&#3657;&#3591;&#3648;&#3611;&#3657;&#3634;&#3627;&#3617;&#3634;&#3618;&#3651;&#3609;&#3585;&#3634;&#3619;&#3607;&#3632;&#3621;&#3623;&#3591;&#3619;&#3632;&#3610;&#3610;&#3609;&#3637;&#3657;&#3651;&#3627;&#3657;&#3652;&#3604;&#3657; 
&#3649;&#3621;&#3632;&#3609;&#3637;&#3656;&#3588;&#3639;&#3629;&#3611;&#3619;&#3632;&#3648;&#3604;&#3655;&#3609;&#3586;&#3629;&#3591;&#3610;&#3607;&#3588;&#3623;&#3634;&#3617;&#3609;&#3637;&#3657;</span></p>
<p><span lang="th">&#3585;&#3656;&#3629;&#3609;&#3629;&#3639;&#3656;&#3609; &#3586;&#3629;&#3607;&#3657;&#3634;&#3623;&#3588;&#3623;&#3634;&#3617;&#3648;&#3585;&#3637;&#3656;&#3618;&#3623;&#3585;&#3633;&#3610;&#3648;&#3619;&#3639;&#3656;&#3629;&#3591;&#3585;&#3634;&#3619;&#3614;&#3636;&#3626;&#3641;&#3592;&#3609;&#3660;&#3605;&#3633;&#3623;&#3605;&#3609;&#3627;&#3619;&#3639;&#3629; </span>
Authentication <span lang="th">&#3585;&#3633;&#3609;&#3585;&#3656;&#3629;&#3609;... 
&#3585;&#3634;&#3619;&#3614;&#3636;&#3626;&#3641;&#3592;&#3609;&#3660;&#3605;&#3633;&#3623;&#3605;&#3609;&#3588;&#3639;&#3629;&#3585;&#3634;&#3619;&#3614;&#3636;&#3626;&#3641;&#3592;&#3609;&#3660;&#3648;&#3614;&#3639;&#3656;&#3629;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3623;&#3656;&#3634;&#3612;&#3641;&#3657;&#3651;&#3594;&#3657;&#3588;&#3639;&#3629;&#3610;&#3640;&#3588;&#3588;&#3621;&#3605;&#3633;&#3623;&#3592;&#3619;&#3636;&#3591; 
&#3595;&#3638;&#3656;&#3591;&#3617;&#3637;&#3649;&#3609;&#3623;&#3607;&#3634;&#3591;&#3651;&#3609;&#3585;&#3634;&#3619;&#3614;&#3636;&#3626;&#3641;&#3592;&#3609;&#3660; </span>3 <span lang="th">&#3619;&#3641;&#3611;&#3649;&#3610;&#3610;&#3588;&#3639;&#3629;</span></p>
<ol>
  <li><span lang="th">&#3651;&#3594;&#3657;&#3626;&#3636;&#3656;&#3591;&#3607;&#3637;&#3656;&#3610;&#3640;&#3588;&#3588;&#3621;&#3612;&#3641;&#3657;&#3609;&#3633;&#3657;&#3609;<b><font color="#FF0000">&#3617;&#3637;</font></b>&#3651;&#3609;&#3585;&#3634;&#3619;&#3614;&#3636;&#3626;&#3641;&#3592;&#3609;&#3660; 
  &#3648;&#3594;&#3656;&#3609; &#3585;&#3634;&#3619;&#3651;&#3594;&#3657; &#3648;&#3629;&#3585;&#3626;&#3634;&#3619;&#3619;&#3633;&#3610;&#3619;&#3629;&#3591;&#3604;&#3636;&#3592;&#3636;&#3605;&#3629;&#3621; </span>(Digital Certificate) <span lang="th">
  &#3585;&#3634;&#3619;&#3651;&#3594;&#3657;&#3610;&#3633;&#3605;&#3619; &#3585;&#3634;&#3619;&#3651;&#3594;&#3657;&#3585;&#3640;&#3597;&#3649;&#3592; &#3648;&#3611;&#3655;&#3609;&#3605;&#3657;&#3609;</span></li>
  <li><span lang="th">&#3651;&#3594;&#3657;&#3626;&#3636;&#3656;&#3591;&#3607;&#3637;&#3656;&#3610;&#3640;&#3588;&#3588;&#3621;&#3612;&#3641;&#3657;&#3609;&#3633;&#3657;&#3609;<b><font color="#FF0000">&#3619;&#3641;&#3657;</font></b>&#3651;&#3609;&#3585;&#3634;&#3619;&#3614;&#3636;&#3626;&#3641;&#3592;&#3609;&#3660; 
  &#3648;&#3594;&#3656;&#3609; &#3585;&#3634;&#3619;&#3651;&#3594;&#3657;&#3619;&#3627;&#3633;&#3626;&#3612;&#3656;&#3634;&#3609; &#3585;&#3634;&#3619;&#3651;&#3594;&#3657;&#3627;&#3617;&#3634;&#3618;&#3648;&#3621;&#3586;&#3611;&#3619;&#3632;&#3592;&#3635;&#3605;&#3633;&#3623; </span>(PIN) <span lang="th">&#3648;&#3611;&#3655;&#3609;&#3605;&#3657;&#3609;</span></li>
  <li><span lang="th">&#3651;&#3594;&#3657;&#3626;&#3636;&#3656;&#3591;&#3607;&#3637;&#3656;&#3610;&#3640;&#3588;&#3588;&#3621;&#3612;&#3641;&#3657;&#3609;&#3633;&#3657;&#3609;<b><font color="#FF0000">&#3648;&#3611;&#3655;&#3609;</font></b>&#3651;&#3609;&#3585;&#3634;&#3619;&#3614;&#3636;&#3626;&#3641;&#3592;&#3609;&#3660; 
  &#3648;&#3594;&#3656;&#3609; &#3585;&#3634;&#3619;&#3651;&#3594;&#3657;&#3621;&#3634;&#3618;&#3609;&#3636;&#3657;&#3623;&#3617;&#3639;&#3629; &#3585;&#3634;&#3619;&#3592;&#3604;&#3592;&#3635;&#3627;&#3609;&#3657;&#3634; &#3627;&#3619;&#3639;&#3629; &#3648;&#3626;&#3637;&#3618;&#3591; &#3648;&#3611;&#3655;&#3609;&#3605;&#3657;&#3609;</span></li>
</ol>
<p><span lang="th">&#3595;&#3638;&#3656;&#3591;&#3588;&#3623;&#3634;&#3617;&#3618;&#3634;&#3585;&#3591;&#3656;&#3634;&#3618;&#3651;&#3609;&#3585;&#3634;&#3619;&#3586;&#3650;&#3617;&#3618; &#3627;&#3619;&#3639;&#3629; &#3611;&#3621;&#3629;&#3617;&#3649;&#3611;&#3621;&#3591;&#3609;&#3633;&#3657;&#3609; 
&#3648;&#3611;&#3655;&#3609;&#3648;&#3619;&#3639;&#3656;&#3629;&#3591;&#3607;&#3637;&#3656;&#3618;&#3629;&#3617;&#3619;&#3633;&#3610;&#3652;&#3604;&#3657;&#3607;&#3633;&#3609;&#3607;&#3637;&#3623;&#3656;&#3634;&#3649;&#3609;&#3623;&#3607;&#3634;&#3591;&#3649;&#3619;&#3585;&#3592;&#3632;&#3591;&#3656;&#3634;&#3618;&#3607;&#3637;&#3656;&#3626;&#3640;&#3604; &#3649;&#3621;&#3632; &#3649;&#3609;&#3623;&#3607;&#3634;&#3591;&#3607;&#3637;&#3656; </span>3
<span lang="th">&#3592;&#3632;&#3618;&#3634;&#3585;&#3607;&#3637;&#3656;&#3626;&#3640;&#3604;</span> <span lang="th">&#3649;&#3605;&#3656;&#3592;&#3640;&#3604;&#3648;&#3626;&#3637;&#3618;&#3586;&#3629;&#3591;&#3649;&#3609;&#3623;&#3607;&#3634;&#3591;&#3607;&#3637;&#3656; </span>
3 <span lang="th">&#3585;&#3655;&#3588;&#3639;&#3629; &#3617;&#3633;&#3609;&#3648;&#3611;&#3655;&#3609;&#3586;&#3657;&#3629;&#3617;&#3641;&#3621;&#3607;&#3637;&#3656;&#3605;&#3636;&#3604;&#3617;&#3634;&#3585;&#3633;&#3610;&#3605;&#3633;&#3623;&#3648;&#3619;&#3634; &#3609;&#3633;&#3656;&#3609;&#3585;&#3655;&#3627;&#3617;&#3634;&#3618;&#3588;&#3623;&#3634;&#3617;&#3623;&#3656;&#3634; 
&#3627;&#3634;&#3585;&#3586;&#3657;&#3629;&#3617;&#3641;&#3621;&#3607;&#3637;&#3656;&#3623;&#3656;&#3634;&#3609;&#3637;&#3657;&#3652;&#3604;&#3657;&#3606;&#3641;&#3585;&#3611;&#3621;&#3629;&#3617;&#3649;&#3611;&#3621;&#3591;&#3652;&#3611; &#3648;&#3619;&#3634;&#3592;&#3632;&#3652;&#3617;&#3656;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3648;&#3611;&#3621;&#3637;&#3656;&#3618;&#3609;&#3649;&#3611;&#3621;&#3591;&#3652;&#3604;&#3657; 
&#3595;&#3638;&#3656;&#3591;&#3605;&#3619;&#3591;&#3585;&#3633;&#3609;&#3586;&#3657;&#3634;&#3617;&#3585;&#3633;&#3610;&#3649;&#3609;&#3623;&#3607;&#3634;&#3591;&#3607;&#3637;&#3656; </span>1 <span lang="th">&#3649;&#3621;&#3632; </span>2 <span lang="th">
&#3595;&#3638;&#3656;&#3591;&#3627;&#3634;&#3585;&#3648;&#3619;&#3634;&#3607;&#3619;&#3634;&#3610; </span>(<span lang="th">&#3627;&#3619;&#3639;&#3629;&#3648;&#3614;&#3637;&#3618;&#3591;&#3649;&#3605;&#3656;&#3626;&#3591;&#3626;&#3633;&#3618;</span>)<span lang="th"> 
&#3623;&#3656;&#3634; &#3586;&#3657;&#3629;&#3617;&#3641;&#3621;&#3621;&#3633;&#3610; &#3627;&#3619;&#3639;&#3629; &#3648;&#3629;&#3585;&#3626;&#3634;&#3619;&#3586;&#3629;&#3591;&#3648;&#3619;&#3634;&#3652;&#3604;&#3657;&#3606;&#3641;&#3585;&#3611;&#3621;&#3629;&#3617;&#3649;&#3611;&#3621;&#3591; &#3627;&#3619;&#3639;&#3629; &#3586;&#3650;&#3617;&#3618;&#3652;&#3611; &#3648;&#3619;&#3634;&#3585;&#3655;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3629;&#3629;&#3585;&#3610;&#3633;&#3605;&#3619; 
&#3627;&#3619;&#3639;&#3629; &#3648;&#3611;&#3621;&#3637;&#3656;&#3618;&#3609; &#3619;&#3627;&#3633;&#3626;&#3612;&#3656;&#3634;&#3609;&#3585;&#3633;&#3609;&#3652;&#3604;&#3657; .... &#3649;&#3605;&#3656;&#3606;&#3657;&#3634;&#3621;&#3634;&#3618;&#3609;&#3636;&#3657;&#3623;&#3617;&#3639;&#3629;&#3648;&#3619;&#3634;&#3606;&#3641;&#3585;&#3611;&#3621;&#3629;&#3617;&#3652;&#3611;&#3649;&#3621;&#3657;&#3623; 
&#3648;&#3619;&#3634;&#3592;&#3632;&#3626;&#3619;&#3657;&#3634;&#3591;&#3621;&#3634;&#3618;&#3609;&#3636;&#3657;&#3623;&#3617;&#3639;&#3629;&#3651;&#3627;&#3617;&#3656;&#3652;&#3604;&#3657;&#3629;&#3618;&#3656;&#3634;&#3591;&#3652;&#3619;&#3585;&#3633;&#3609; </span>???!!</p>
<p><span lang="th">&#3649;&#3621;&#3632;&#3585;&#3656;&#3629;&#3609;&#3607;&#3637;&#3656;&#3592;&#3632;&#3648;&#3621;&#3656;&#3634;&#3606;&#3638;&#3591;&#3623;&#3636;&#3608;&#3637;&#3585;&#3634;&#3619;&#3611;&#3621;&#3629;&#3617;&#3649;&#3611;&#3621;&#3591;&#3621;&#3634;&#3618;&#3609;&#3636;&#3657;&#3623;&#3617;&#3639;&#3629; 
&#3607;&#3637;&#3656;&#3648;&#3611;&#3655;&#3609;&#3586;&#3656;&#3634;&#3623;&#3648;&#3611;&#3636;&#3604;&#3648;&#3612;&#3618;&#3585;&#3633;&#3609;&#3652;&#3611;&#3649;&#3621;&#3657;&#3623; 
&#3585;&#3655;&#3586;&#3629;&#3618;&#3657;&#3629;&#3609;&#3588;&#3623;&#3634;&#3617;&#3651;&#3627;&#3657;&#3648;&#3627;&#3655;&#3609;&#3606;&#3638;&#3591;&#3623;&#3636;&#3608;&#3637;&#3585;&#3634;&#3619;&#3614;&#3636;&#3626;&#3641;&#3592;&#3609;&#3660;&#3605;&#3633;&#3623;&#3605;&#3609;&#3604;&#3657;&#3623;&#3618;&#3621;&#3634;&#3618;&#3609;&#3636;&#3657;&#3623;&#3617;&#3639;&#3629;&#3585;&#3633;&#3609;&#3626;&#3633;&#3585;&#3609;&#3636;&#3604; 
&#3648;&#3614;&#3639;&#3656;&#3629;&#3648;&#3611;&#3655;&#3609;&#3585;&#3634;&#3619;&#3611;&#3641;&#3614;&#3639;&#3657;&#3609;&#3651;&#3627;&#3657;&#3648;&#3586;&#3657;&#3634;&#3651;&#3592;&#3623;&#3636;&#3608;&#3637;&#3585;&#3634;&#3619;&#3611;&#3621;&#3629;&#3617;&#3649;&#3611;&#3621;&#3591;&#3652;&#3604;&#3657;&#3591;&#3656;&#3634;&#3618;&#3586;&#3638;&#3657;&#3609;</span></p>
<p><span lang="th">&#3607;&#3640;&#3585;&#3607;&#3656;&#3634;&#3609;&#3588;&#3591;&#3607;&#3619;&#3634;&#3610;&#3585;&#3633;&#3609;&#3629;&#3618;&#3641;&#3656;&#3649;&#3621;&#3657;&#3623;&#3623;&#3656;&#3634; 
&#3617;&#3609;&#3640;&#3625;&#3618;&#3660;&#3607;&#3640;&#3585;&#3588;&#3609;&#3592;&#3632;&#3617;&#3637;&#3621;&#3634;&#3618;&#3609;&#3636;&#3657;&#3623;&#3617;&#3639;&#3629;&#3607;&#3637;&#3656;&#3652;&#3617;&#3656;&#3648;&#3627;&#3617;&#3639;&#3629;&#3609;&#3585;&#3633;&#3609; &#3621;&#3633;&#3585;&#3625;&#3603;&#3632;&#3586;&#3629;&#3591;&#3621;&#3634;&#3618;&#3609;&#3636;&#3657;&#3623;&#3617;&#3639;&#3629;&#3649;&#3610;&#3656;&#3591;&#3627;&#3621;&#3633;&#3585; &#3654; &#3652;&#3604;&#3657;&#3648;&#3611;&#3655;&#3609;
</span>3 <span lang="th">&#3611;&#3619;&#3632;&#3648;&#3616;&#3607; &#3605;&#3634;&#3617;&#3619;&#3641;&#3611;&#3586;&#3657;&#3634;&#3591;&#3621;&#3656;&#3634;&#3591;&#3609;&#3637;&#3657;</span></p>
<blockquote>
  <blockquote>
    <blockquote>
      <blockquote>
        <p>
        <img border="0" src="./Fingerprint_files/Pages_from_finger_print.jpg" width="394" height="187"></p>
      </blockquote>
    </blockquote>
  </blockquote>
</blockquote>
<p><span lang="th">&#3619;&#3641;&#3611;&#3649;&#3619;&#3585; </span>(Arch) <span lang="th">
&#3648;&#3611;&#3655;&#3609;&#3621;&#3634;&#3618;&#3609;&#3636;&#3657;&#3623;&#3617;&#3639;&#3629;&#3607;&#3637;&#3656;&#3648;&#3626;&#3657;&#3609;&#3592;&#3632;&#3648;&#3619;&#3636;&#3656;&#3617;&#3592;&#3634;&#3585;&#3609;&#3636;&#3657;&#3623;&#3617;&#3639;&#3629;&#3613;&#3633;&#3656;&#3591;&#3627;&#3609;&#3638;&#3656;&#3591; &#3649;&#3621;&#3632;&#3652;&#3611;&#3626;&#3636;&#3657;&#3609;&#3626;&#3640;&#3604;&#3607;&#3637;&#3656;&#3629;&#3637;&#3585;&#3613;&#3633;&#3656;&#3591;&#3627;&#3609;&#3638;&#3656;&#3591; <br>
&#3619;&#3641;&#3611;&#3585;&#3621;&#3634;&#3591; </span>(Loop)<span lang="th"> 
&#3648;&#3611;&#3655;&#3609;&#3621;&#3634;&#3618;&#3609;&#3636;&#3657;&#3623;&#3617;&#3639;&#3629;&#3607;&#3637;&#3656;&#3648;&#3626;&#3657;&#3609;&#3592;&#3632;&#3648;&#3619;&#3636;&#3656;&#3617;&#3592;&#3634;&#3585;&#3609;&#3636;&#3657;&#3623;&#3617;&#3639;&#3629;&#3613;&#3633;&#3656;&#3591;&#3627;&#3609;&#3638;&#3656;&#3591; &#3621;&#3634;&#3585;&#3618;&#3634;&#3623;&#3652;&#3611;&#3585;&#3621;&#3634;&#3591;&#3609;&#3636;&#3657;&#3623;&#3617;&#3639;&#3629; 
&#3649;&#3621;&#3632;&#3650;&#3588;&#3657;&#3591;&#3585;&#3621;&#3633;&#3610;&#3617;&#3634;&#3626;&#3636;&#3657;&#3609;&#3626;&#3640;&#3604;&#3607;&#3637;&#3656;&#3613;&#3633;&#3656;&#3591;&#3648;&#3604;&#3636;&#3617;</span> <br>
<span lang="th">&#3619;&#3641;&#3611;&#3626;&#3640;&#3604;&#3607;&#3657;&#3634;&#3618; </span>(Whorl)<span lang="th"> 
&#3648;&#3611;&#3655;&#3609;&#3621;&#3634;&#3618;&#3609;&#3636;&#3657;&#3623;&#3617;&#3639;&#3629;&#3607;&#3637;&#3656;&#3617;&#3657;&#3623;&#3609;&#3648;&#3611;&#3655;&#3609;&#3619;&#3641;&#3611;&#3585;&#3657;&#3609;&#3627;&#3629;&#3618;</span></p>
<p><span lang="th">&#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3585;&#3634;&#3619;&#3605;&#3619;&#3623;&#3592;&#3604;&#3641;&#3621;&#3634;&#3618;&#3609;&#3636;&#3657;&#3623;&#3617;&#3639;&#3629; </span>2 <span lang="th">
&#3619;&#3634;&#3618;&#3585;&#3634;&#3619;&#3623;&#3656;&#3634;&#3648;&#3611;&#3655;&#3609;&#3621;&#3634;&#3618;&#3648;&#3604;&#3637;&#3618;&#3623;&#3585;&#3633;&#3609;&#3627;&#3619;&#3639;&#3629;&#3652;&#3617;&#3656;&#3609;&#3633;&#3657;&#3609; &#3617;&#3637;&#3627;&#3621;&#3634;&#3585;&#3627;&#3621;&#3634;&#3618;&#3623;&#3636;&#3608;&#3637;&#3604;&#3657;&#3623;&#3618;&#3585;&#3633;&#3609; 
&#3649;&#3605;&#3656;&#3623;&#3636;&#3608;&#3637;&#3607;&#3637;&#3656;&#3648;&#3611;&#3655;&#3609;&#3607;&#3637;&#3656;&#3609;&#3636;&#3618;&#3617;&#3585;&#3633;&#3609;&#3617;&#3634;&#3585;&#3607;&#3637;&#3656;&#3626;&#3640;&#3604; &#3652;&#3604;&#3657;&#3649;&#3585;&#3656;&#3585;&#3634;&#3619;&#3648;&#3611;&#3619;&#3637;&#3618;&#3610;&#3648;&#3607;&#3637;&#3618;&#3610;&#3592;&#3640;&#3604;&#3626;&#3633;&#3591;&#3648;&#3585;&#3605;&#3648;&#3621;&#3655;&#3585; &#3654; </span>
(minutiae)<span lang="th"> &#3592;&#3640;&#3604;&#3607;&#3637;&#3656;&#3623;&#3656;&#3634;&#3609;&#3637;&#3657;&#3588;&#3639;&#3629;&#3592;&#3640;&#3604;&#3607;&#3637;&#3656;&#3648;&#3626;&#3657;&#3609;&#3621;&#3634;&#3618;&#3609;&#3636;&#3657;&#3623;&#3617;&#3639;&#3629; </span>(ridge)<span lang="th"> 
&#3617;&#3634;&#3610;&#3619;&#3619;&#3592;&#3610;&#3585;&#3633;&#3609; &#3627;&#3619;&#3639;&#3629; &#3649;&#3618;&#3585;&#3629;&#3629;&#3585;&#3592;&#3634;&#3585;&#3585;&#3633;&#3609; &#3627;&#3619;&#3639;&#3629; &#3648;&#3611;&#3655;&#3609;&#3592;&#3640;&#3604;&#3592;&#3610;&#3586;&#3629;&#3591;&#3648;&#3626;&#3657;&#3609; 
&#3649;&#3621;&#3632;&#3592;&#3640;&#3604;&#3607;&#3637;&#3656;&#3623;&#3656;&#3634;&#3609;&#3637;&#3657;&#3586;&#3629;&#3591;&#3649;&#3605;&#3656;&#3621;&#3632;&#3588;&#3609;&#3592;&#3632;&#3652;&#3617;&#3656;&#3648;&#3627;&#3617;&#3639;&#3629;&#3609;&#3585;&#3633;&#3609; </span>(FBI <span lang="th">
&#3652;&#3604;&#3657;&#3626;&#3619;&#3640;&#3611;&#3649;&#3621;&#3657;&#3623;&#3623;&#3656;&#3634; &#3588;&#3609;&#3649;&#3605;&#3656;&#3621;&#3632;&#3588;&#3609;&#3592;&#3632;&#3617;&#3637;&#3652;&#3617;&#3656;&#3617;&#3637;&#3607;&#3634;&#3591;&#3617;&#3637;&#3592;&#3640;&#3604;&#3626;&#3633;&#3591;&#3648;&#3585;&#3605;&#3607;&#3637;&#3656;&#3623;&#3656;&#3634;&#3609;&#3637;&#3657;&#3648;&#3627;&#3617;&#3639;&#3629;&#3609;&#3585;&#3633;&#3609; &#3648;&#3585;&#3636;&#3609;&#3585;&#3623;&#3656;&#3634;</span> 
8 <span lang="th">&#3592;&#3640;&#3604;</span>)<span lang="th"> &#3619;&#3641;&#3611;&#3586;&#3657;&#3634;&#3591;&#3621;&#3656;&#3634;&#3591; 
&#3649;&#3626;&#3604;&#3591;&#3605;&#3633;&#3623;&#3629;&#3618;&#3656;&#3634;&#3591;&#3586;&#3629;&#3591;&#3592;&#3640;&#3604;&#3607;&#3637;&#3656;&#3623;&#3656;&#3634;&#3609;&#3637;&#3657;</span></p>
<blockquote>
  <blockquote>
    <blockquote>
      <p>
      <img border="0" src="./Fingerprint_files/Pages_from_finger_print_2.jpg" width="581" height="285"></p>
    </blockquote>
  </blockquote>
</blockquote>
<p><span lang="th">&#3605;&#3633;&#3623;&#3629;&#3618;&#3656;&#3634;&#3591;&#3619;&#3634;&#3618;&#3585;&#3634;&#3619;&#3586;&#3629;&#3591;&#3592;&#3640;&#3604;&#3626;&#3633;&#3591;&#3648;&#3585;&#3605; &#3652;&#3604;&#3657;&#3649;&#3585;&#3656;</span></p>
<ol>
  <li>Bifurcation <span lang="th">&#3648;&#3611;&#3655;&#3609;&#3592;&#3640;&#3604;&#3607;&#3637;&#3656;&#3649;&#3618;&#3585;&#3648;&#3626;&#3657;&#3609;&#3629;&#3629;&#3585;&#3648;&#3611;&#3655;&#3609;&#3627;&#3621;&#3634;&#3618;&#3648;&#3626;&#3657;&#3609; </span></li>
  <li>Divergence <span lang="th">&#3648;&#3611;&#3655;&#3609;&#3592;&#3640;&#3604;&#3607;&#3637;&#3656;&#3648;&#3626;&#3657;&#3609; </span>2 <span lang="th">
  &#3648;&#3626;&#3657;&#3609;&#3607;&#3637;&#3656;&#3629;&#3618;&#3641;&#3656;&#3586;&#3609;&#3634;&#3609;&#3585;&#3633;&#3609; &#3649;&#3618;&#3585;&#3629;&#3629;&#3585;&#3592;&#3634;&#3585;&#3585;&#3633;&#3609; &#3627;&#3619;&#3639;&#3629; &#3648;&#3586;&#3657;&#3634;&#3617;&#3634;&#3619;&#3623;&#3617;&#3585;&#3633;&#3609;</span></li>
  <li>Enclosure <span lang="th">&#3648;&#3611;&#3655;&#3609;&#3621;&#3633;&#3585;&#3625;&#3603;&#3632;&#3607;&#3637;&#3656;&#3648;&#3626;&#3657;&#3609;&#3649;&#3618;&#3585;&#3629;&#3629;&#3585;&#3592;&#3634;&#3585;&#3585;&#3633;&#3609; &#3649;&#3621;&#3632; 
  &#3585;&#3621;&#3633;&#3610;&#3617;&#3634;&#3619;&#3623;&#3617;&#3585;&#3633;&#3609;&#3648;&#3611;&#3655;&#3609;&#3648;&#3626;&#3657;&#3609;&#3648;&#3604;&#3637;&#3618;&#3623;&#3585;&#3633;&#3609;&#3651;&#3627;&#3617;&#3656;</span></li>
  <li>Endings <span lang="th">&#3588;&#3639;&#3629;&#3605;&#3635;&#3649;&#3627;&#3609;&#3656;&#3591;&#3607;&#3637;&#3656;&#3648;&#3626;&#3657;&#3609;&#3609;&#3633;&#3657;&#3609;&#3626;&#3636;&#3657;&#3609;&#3626;&#3640;&#3604;&#3621;&#3591; </span></li>
</ol>
<p><span lang="th">&#3651;&#3609;&#3585;&#3634;&#3619;&#3610;&#3633;&#3609;&#3607;&#3638;&#3585;&#3621;&#3634;&#3618;&#3609;&#3636;&#3657;&#3623;&#3617;&#3639;&#3629; 
&#3585;&#3655;&#3592;&#3632;&#3617;&#3637;&#3585;&#3634;&#3619;&#3610;&#3633;&#3609;&#3607;&#3638;&#3585;&#3605;&#3635;&#3649;&#3627;&#3609;&#3656;&#3591;&#3586;&#3629;&#3591;&#3592;&#3640;&#3604;&#3626;&#3633;&#3591;&#3648;&#3585;&#3605;&#3648;&#3627;&#3621;&#3656;&#3634;&#3609;&#3637;&#3657;&#3652;&#3623;&#3657; &#3595;&#3638;&#3656;&#3591;&#3611;&#3585;&#3605;&#3636;&#3649;&#3621;&#3657;&#3623;&#3592;&#3632;&#3610;&#3633;&#3609;&#3607;&#3638;&#3585;&#3652;&#3623;&#3657;&#3611;&#3619;&#3632;&#3617;&#3634;&#3603;
</span>30-40 <span lang="th">&#3592;&#3640;&#3604;&#3605;&#3656;&#3629; </span>1 <span lang="th">&#3621;&#3634;&#3618;&#3609;&#3636;&#3657;&#3623;&#3617;&#3639;&#3629; 
&#3649;&#3621;&#3632;&#3609;&#3635;&#3586;&#3657;&#3629;&#3617;&#3641;&#3621;&#3617;&#3634;&#3648;&#3611;&#3619;&#3637;&#3618;&#3610;&#3648;&#3607;&#3637;&#3618;&#3610;&#3585;&#3633;&#3610;&#3621;&#3634;&#3618;&#3609;&#3636;&#3657;&#3623;&#3617;&#3639;&#3629;&#3607;&#3637;&#3656;&#3626;&#3649;&#3585;&#3609;&#3648;&#3586;&#3657;&#3634;&#3617;&#3634;&#3623;&#3656;&#3634;&#3605;&#3619;&#3591;&#3585;&#3633;&#3609;&#3627;&#3619;&#3639;&#3629;&#3652;&#3617;&#3656;</span></p>
<p><span lang="th">&#3651;&#3609;&#3611;&#3633;&#3592;&#3592;&#3640;&#3610;&#3633;&#3609; &#3629;&#3640;&#3611;&#3585;&#3619;&#3603;&#3660;&#3651;&#3609;&#3585;&#3634;&#3619;&#3626;&#3649;&#3585;&#3609;&#3621;&#3634;&#3618;&#3609;&#3636;&#3657;&#3623;&#3617;&#3639;&#3629; 
&#3649;&#3621;&#3632;&#3595;&#3629;&#3615;&#3605;&#3660;&#3649;&#3623;&#3619;&#3660;&#3651;&#3609;&#3585;&#3634;&#3619;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610; &#3617;&#3637;&#3619;&#3634;&#3588;&#3634;&#3606;&#3641;&#3585;&#3621;&#3591;&#3617;&#3634;&#3585; &#3649;&#3621;&#3632;&#3607;&#3635;&#3591;&#3634;&#3609;&#3652;&#3604;&#3657;&#3629;&#3618;&#3656;&#3634;&#3591;&#3609;&#3656;&#3634;&#3648;&#3594;&#3639;&#3656;&#3629;&#3606;&#3639;&#3629; 
&#3592;&#3638;&#3591;&#3617;&#3637;&#3585;&#3634;&#3619;&#3609;&#3635;&#3617;&#3634;&#3651;&#3594;&#3657;&#3585;&#3633;&#3609;&#3629;&#3618;&#3656;&#3634;&#3591;&#3649;&#3614;&#3619;&#3656;&#3627;&#3621;&#3634;&#3618;&#3617;&#3634;&#3585;&#3586;&#3638;&#3657;&#3609; &#3592;&#3638;&#3591;&#3648;&#3611;&#3655;&#3609;&#3607;&#3637;&#3656;&#3627;&#3617;&#3634;&#3618;&#3611;&#3629;&#3591;&#3586;&#3629;&#3591;&#3610;&#3619;&#3619;&#3604;&#3634;&#3609;&#3633;&#3585;&#3649;&#3630;&#3585;&#3648;&#3585;&#3629;&#3619;&#3660;&#3607;&#3637;&#3656;&#3648;&#3619;&#3636;&#3656;&#3617;&#3627;&#3633;&#3609;&#3648;&#3627;&#3588;&#3623;&#3634;&#3617;&#3626;&#3609;&#3651;&#3592;&#3651;&#3609;&#3585;&#3634;&#3619;&#3648;&#3592;&#3634;&#3632;&#3586;&#3657;&#3629;&#3617;&#3641;&#3621;&#3617;&#3634;&#3627;&#3634;&#3607;&#3634;&#3591;&#3651;&#3609;&#3585;&#3634;&#3619;&#3611;&#3621;&#3629;&#3617;&#3621;&#3634;&#3618;&#3609;&#3636;&#3657;&#3623;&#3617;&#3639;&#3629;&#3585;&#3633;&#3609;&#3617;&#3634;&#3585;&#3586;&#3638;&#3657;&#3609;&#3652;&#3611;&#3604;&#3657;&#3623;&#3618;&nbsp; 
&#3649;&#3621;&#3632; &#3619;&#3634;&#3618;&#3649;&#3619;&#3585;&#3607;&#3637;&#3656;&#3629;&#3629;&#3585;&#3617;&#3634;&#3648;&#3611;&#3636;&#3604;&#3648;&#3612;&#3618;&#3588;&#3623;&#3634;&#3617;&#3626;&#3635;&#3648;&#3619;&#3655;&#3592;&#3651;&#3609;&#3585;&#3634;&#3619;&#3611;&#3621;&#3629;&#3617;&#3649;&#3611;&#3621;&#3591;&#3652;&#3604;&#3657;&#3649;&#3585;&#3656;&#3609;&#3633;&#3585;&#3648;&#3592;&#3634;&#3632;&#3594;&#3634;&#3623;&#3597;&#3637;&#3656;&#3611;&#3640;&#3656;&#3609; 
&#3595;&#3638;&#3656;&#3591;&#3605;&#3637;&#3614;&#3636;&#3617;&#3614;&#3660;&#3648;&#3629;&#3585;&#3626;&#3634;&#3619;&#3648;&#3617;&#3639;&#3656;&#3629;&#3605;&#3657;&#3609;&#3611;&#3637; </span>2002 <span lang="th">&#3605;&#3634;&#3617;&#3604;&#3657;&#3623;&#3618;&#3594;&#3634;&#3623;&#3648;&#3618;&#3629;&#3619;&#3617;&#3633;&#3609; 
&#3651;&#3609;&#3611;&#3621;&#3634;&#3618;&#3611;&#3637;&#3648;&#3604;&#3637;&#3618;&#3623;&#3585;&#3633;&#3609; &#3617;&#3634;&#3651;&#3609;&#3611;&#3633;&#3592;&#3592;&#3640;&#3610;&#3633;&#3609; &#3623;&#3636;&#3608;&#3637;&#3585;&#3634;&#3619;&#3609;&#3637;&#3657;&#3648;&#3611;&#3655;&#3609;&#3607;&#3637;&#3656;&#3648;&#3611;&#3636;&#3604;&#3648;&#3612;&#3618;&#3651;&#3609;&#3648;&#3623;&#3611;&#3652;&#3595;&#3607;&#3660;&#3607;&#3633;&#3656;&#3623; &#3654; &#3652;&#3611; 
&#3595;&#3638;&#3656;&#3591;&#3592;&#3632;&#3586;&#3629;&#3626;&#3619;&#3640;&#3611;&#3623;&#3636;&#3608;&#3637;&#3585;&#3634;&#3619;&#3651;&#3627;&#3657;&#3614;&#3629;&#3617;&#3629;&#3591;&#3648;&#3627;&#3655;&#3609;&#3616;&#3634;&#3614;&#3652;&#3604;&#3657; &#3604;&#3633;&#3591;&#3609;&#3637;&#3657;</span></p>
<p><span lang="th">&#3649;&#3609;&#3623;&#3607;&#3634;&#3591;&#3585;&#3634;&#3619;&#3611;&#3621;&#3629;&#3617;&#3621;&#3634;&#3618;&#3609;&#3636;&#3657;&#3623;&#3617;&#3639;&#3629; 
&#3648;&#3619;&#3636;&#3656;&#3617;&#3592;&#3634;&#3585;&#3585;&#3634;&#3619;&#3627;&#3634;&#3621;&#3634;&#3618;&#3609;&#3636;&#3657;&#3623;&#3617;&#3639;&#3629;&#3605;&#3657;&#3609;&#3593;&#3610;&#3633;&#3610;&#3651;&#3627;&#3657;&#3652;&#3604;&#3657;&#3585;&#3656;&#3629;&#3609; 
&#3595;&#3638;&#3656;&#3591;&#3585;&#3655;&#3648;&#3611;&#3655;&#3609;&#3623;&#3636;&#3608;&#3637;&#3648;&#3604;&#3637;&#3618;&#3623;&#3585;&#3633;&#3610;&#3607;&#3637;&#3656;&#3648;&#3619;&#3634;&#3648;&#3627;&#3655;&#3609;&#3651;&#3609;&#3627;&#3609;&#3633;&#3591;&#3607;&#3637;&#3656;&#3605;&#3635;&#3619;&#3623;&#3592;&#3651;&#3594;&#3657; &#3588;&#3639;&#3629; &#3585;&#3634;&#3619;&#3651;&#3594;&#3657;&#3612;&#3591;&#3585;&#3619;&#3634;&#3652;&#3615;&#3605;&#3660; 
&#3614;&#3656;&#3609;&#3652;&#3611;&#3618;&#3633;&#3591;&#3623;&#3633;&#3626;&#3604;&#3640;&#3607;&#3637;&#3656;&#3609;&#3636;&#3657;&#3623;&#3609;&#3633;&#3657;&#3609;&#3652;&#3611;&#3592;&#3633;&#3610;&#3605;&#3657;&#3629;&#3591; &#3648;&#3594;&#3656;&#3609; &#3649;&#3585;&#3657;&#3623;&#3609;&#3657;&#3635; &#3621;&#3641;&#3585;&#3610;&#3636;&#3604;&#3611;&#3619;&#3632;&#3605;&#3641; &#3648;&#3611;&#3655;&#3609;&#3605;&#3657;&#3609; &#3592;&#3634;&#3585;&#3609;&#3633;&#3657;&#3609; 
&#3585;&#3655;&#3606;&#3656;&#3634;&#3618;&#3619;&#3641;&#3611;&#3621;&#3634;&#3618;&#3609;&#3636;&#3657;&#3623;&#3617;&#3639;&#3629;&#3609;&#3637;&#3657;&#3652;&#3623;&#3657; &#3649;&#3621;&#3657;&#3623;&#3614;&#3636;&#3617;&#3614;&#3660;&#3610;&#3609;&#3585;&#3619;&#3632;&#3604;&#3634;&#3625;&#3650;&#3611;&#3619;&#3656;&#3591;&#3651;&#3626; &#3604;&#3657;&#3623;&#3618;&#3648;&#3588;&#3619;&#3639;&#3656;&#3629;&#3591;&#3614;&#3636;&#3617;&#3614;&#3660;&#3648;&#3621;&#3648;&#3595;&#3629;&#3619;&#3660;
</span>(<span lang="th">&#3649;&#3621;&#3632;&#3648;&#3609;&#3639;&#3656;&#3629;&#3591;&#3592;&#3634;&#3585;&#3619;&#3641;&#3611;&#3607;&#3637;&#3656;&#3606;&#3656;&#3634;&#3618;&#3648;&#3611;&#3655;&#3609;&#3619;&#3641;&#3611;&#3649;&#3610;&#3610;&#3604;&#3636;&#3592;&#3636;&#3605;&#3629;&#3621; 
&#3648;&#3619;&#3634;&#3592;&#3638;&#3591;&#3618;&#3633;&#3591;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3651;&#3594;&#3657;&#3595;&#3629;&#3615;&#3605;&#3660;&#3649;&#3623;&#3619;&#3660;&#3594;&#3656;&#3623;&#3618;&#3649;&#3605;&#3656;&#3591;&#3616;&#3634;&#3614;&#3651;&#3609;&#3626;&#3656;&#3623;&#3609;&#3607;&#3637;&#3656;&#3621;&#3610;&#3648;&#3621;&#3639;&#3629;&#3609;&#3651;&#3627;&#3657;&#3585;&#3619;&#3632;&#3592;&#3656;&#3634;&#3591;&#3594;&#3633;&#3604;&#3586;&#3638;&#3657;&#3609;&#3652;&#3604;&#3657;</span>)<span lang="th"> 
&#3626;&#3656;&#3623;&#3609;&#3607;&#3637;&#3656;&#3614;&#3636;&#3617;&#3614;&#3660;&#3592;&#3632;&#3609;&#3641;&#3609;&#3629;&#3629;&#3585;&#3617;&#3634;&#3614;&#3629;&#3607;&#3637;&#3656;&#3592;&#3632;&#3652;&#3611;&#3651;&#3594;&#3657;&#3651;&#3609;&#3585;&#3634;&#3619;&#3607;&#3635;&#3614;&#3636;&#3617;&#3614;&#3660;&#3649;&#3610;&#3610;&#3652;&#3604;&#3657; </span></p>
<p><span lang="th">&#3648;&#3611;&#3657;&#3634;&#3627;&#3617;&#3634;&#3618;&#3586;&#3629;&#3591;&#3610;&#3607;&#3588;&#3623;&#3634;&#3617;&#3609;&#3637;&#3657; &#3617;&#3637;&#3586;&#3638;&#3657;&#3609;&#3648;&#3614;&#3639;&#3656;&#3629;&#3618;&#3639;&#3609;&#3618;&#3633;&#3609;&#3623;&#3656;&#3634;&#3651;&#3609;&#3650;&#3621;&#3585;&#3609;&#3637;&#3657; 
&#3652;&#3617;&#3656;&#3617;&#3637;&#3629;&#3632;&#3652;&#3619;&#3607;&#3637;&#3656;&#3611;&#3621;&#3629;&#3604;&#3616;&#3633;&#3618; </span>100% <span lang="th">
&#3650;&#3604;&#3618;&#3648;&#3593;&#3614;&#3634;&#3632;&#3648;&#3617;&#3639;&#3656;&#3629;&#3648;&#3619;&#3634;&#3651;&#3594;&#3657;&#3591;&#3634;&#3609;&#3629;&#3618;&#3656;&#3634;&#3591;&#3627;&#3621;&#3632;&#3627;&#3621;&#3623;&#3617; &#3604;&#3633;&#3591;&#3609;&#3633;&#3657;&#3609; &#3585;&#3634;&#3619;&#3651;&#3594;&#3657;&#3621;&#3634;&#3618;&#3609;&#3636;&#3657;&#3623;&#3617;&#3639;&#3629;&#3651;&#3609;&#3585;&#3634;&#3619;&#3614;&#3636;&#3626;&#3641;&#3592;&#3609;&#3660;&#3605;&#3633;&#3623;&#3605;&#3609; 
&#3585;&#3655;&#3588;&#3591;&#3648;&#3627;&#3617;&#3634;&#3632;&#3648;&#3614;&#3637;&#3618;&#3591;&#3585;&#3633;&#3610;&#3585;&#3634;&#3619;&#3651;&#3594;&#3657;&#3591;&#3634;&#3609;&#3626;&#3656;&#3623;&#3609;&#3610;&#3640;&#3588;&#3588;&#3621; &#3648;&#3594;&#3656;&#3609;&#3651;&#3594;&#3657;&#3585;&#3633;&#3610;&#3648;&#3588;&#3619;&#3639;&#3656;&#3629;&#3591; </span>PDA <span lang="th">
&#3627;&#3619;&#3639;&#3629; &#3651;&#3594;&#3657;&#3585;&#3633;&#3610;&#3591;&#3634;&#3609;&#3607;&#3637;&#3656;&#3652;&#3617;&#3656;&#3592;&#3619;&#3636;&#3591;&#3592;&#3633;&#3591;&#3609;&#3633;&#3585; &#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3591;&#3634;&#3609;&#3607;&#3637;&#3656;&#3617;&#3637;&#3588;&#3623;&#3634;&#3617;&#3626;&#3635;&#3588;&#3633;&#3597;&#3617;&#3634;&#3585; &#3654; &#3627;&#3634;&#3585;&#3592;&#3632;&#3651;&#3594;&#3657;&#3621;&#3634;&#3618;&#3609;&#3636;&#3657;&#3623;&#3617;&#3639;&#3629; 
&#3585;&#3655;&#3588;&#3591;&#3592;&#3632;&#3605;&#3657;&#3629;&#3591;&#3612;&#3626;&#3617;&#3612;&#3626;&#3634;&#3609;&#3585;&#3633;&#3610;&#3585;&#3634;&#3619;&#3614;&#3636;&#3626;&#3641;&#3592;&#3609;&#3660;&#3605;&#3633;&#3623;&#3605;&#3609;&#3651;&#3609;&#3619;&#3641;&#3611;&#3649;&#3610;&#3610;&#3629;&#3639;&#3656;&#3609;&#3648;&#3586;&#3657;&#3634;&#3652;&#3611;&#3604;&#3657;&#3623;&#3618; &#3648;&#3594;&#3656;&#3609; 
&#3585;&#3634;&#3619;&#3651;&#3594;&#3657;&#3588;&#3623;&#3610;&#3588;&#3641;&#3656;&#3585;&#3633;&#3610;&#3619;&#3627;&#3633;&#3626;&#3621;&#3633;&#3610; &#3627;&#3619;&#3639;&#3629; </span>PIN <span lang="th">&#3648;&#3611;&#3655;&#3609;&#3605;&#3657;&#3609; &#3648;&#3614;&#3637;&#3618;&#3591;&#3648;&#3607;&#3656;&#3634;&#3609;&#3637;&#3657; 
&#3585;&#3655;&#3588;&#3591;&#3592;&#3632;&#3626;&#3619;&#3657;&#3634;&#3591;&#3588;&#3623;&#3634;&#3617;&#3611;&#3621;&#3629;&#3604;&#3616;&#3633;&#3618;&#3651;&#3627;&#3657;&#3648;&#3585;&#3636;&#3604;&#3586;&#3638;&#3657;&#3609;&#3652;&#3604;&#3657;&#3629;&#3637;&#3585;&#3619;&#3632;&#3604;&#3633;&#3610;&#3627;&#3609;&#3638;&#3656;&#3591;&#3649;&#3621;&#3657;&#3623;</span></p>
<p class="section1"><b><span lang="TH" style="FONT-FAMILY: Tahoma">&#3648;&#3629;&#3585;&#3626;&#3634;&#3619;&#3629;&#3657;&#3634;&#3591;&#3629;&#3636;&#3591;
</span></b><font face="Tahoma">:</font></p>
<font face="Tahoma">
<p align="LEFT">Yevgeniy Libov, Biometrics: Technology that Gives You a Password 
You Can't Share.</p>
<p align="LEFT">
<a href="http://www.geek.com/news/geeknews/2002may/gee20020517011758.htm">
Fingerprint Sensors Hacked.</a></p>
</font>
<p class="section1">
<font face="Tahoma">May 24, 05</font></p>
<p>&nbsp;</p>
<p>&nbsp;</p>




</body></html>